bolknote/MK61S_MINI/code/tools.cpp
  const int address = nSlot * FLASH_SECTOR_SIZE;

  dbgln(SPIROM, "X-reg as addsress ", address);
  return address;
}

isize  calc_address(void) {
  const isize n_cell = MK61Emu_GetDisplayReg();

  if(n_cell > MAX_SLOT_FOR_PROGRAM) {
    main_lcd().setCursor(0, 0); main_lcd().print(library_mk61::text("Error! slot > ", "SLOT > ")); main_lcd().print(MAX_SLOT_FOR_PROGRAM);
    return -1;
  } else {
    /*main_lcd().print("slot ");*/ main_lcd().print(n_cell);
  }

  const int address = n_cell * FLASH_SECTOR_SIZE;

  #ifdef SERIAL_OUTPUT
    Serial.print("X-reg as addsress "); Serial.println(address);
  #endif
  return address;
}

void init_external_flash(void) {
  dbgln(SPIROM, "Init flash -> ");

  // Инициализация SPI
  SPI.begin();
 
  // Обнаружение через JEDEC/SFDP; для неизвестных микросхем C6 проверяет границы.
  flash_is_ok = external_flash().begin();
  #ifdef DEBUG_SPIFLASH
    if(flash_is_ok) {
      Serial.println("SPI NOR link: OK");
      Serial.print("JEDEC ID: 0x"); Serial.println(external_flash().getJEDECID(), HEX);
      Serial.print("SFDP: "); Serial.println(external_flash().sfdpPresent() ? "yes" : "no");
      Serial.print("declared upper bound: ");
      Serial.print(external_flash().capacityProbeUpper()); Serial.println(" bytes");
    } else {
      Serial.println("SPI NOR link: ERROR");
    }
  #endif
  if(!flash_is_ok) return;

  dbgln(SPIROM, "C6 init: start");
  program_store::init();
  #ifdef DEBUG_SPIFLASH
    if(program_store::ready()) {
      Serial.print("C6 init: ready, measured capacity: ");
      Serial.print(external_flash().getCapacity()); Serial.println(" bytes");
    } else if(program_store::mount_status() ==
              program_store::MountStatus::FORMAT_REQUIRED) {
      Serial.println("C5 init: legacy volume; explicit format required");
    } else if(program_store::mount_status() ==
              program_store::MountStatus::REPAIR_REQUIRED) {
      Serial.println("C6 init: catalogs damaged; explicit format required");
    } else {
      Serial.println("C6 init: failed");
    }
  #endif
}

u8 load_word(isize segment_address, isize offset) {
  (void) segment_address;
  (void) offset;
#if MK61_USE_ARDUINO_EEPROM_FALLBACK
  return EEPROM.read(offset);
#else
  return 0xFF;
#endif
}

bool load_from(isize address) {
  if(address < 0 || address % FLASH_SECTOR_SIZE != 0) return false;
  char name[8];
  snprintf(name, sizeof(name), "%u",
           (unsigned) (address / FLASH_SECTOR_SIZE));
  return m61_text::load_program(name);
}

bool Load(usize nSlot) {
  char name[8];
  snprintf(name, sizeof(name), "%u", (unsigned) nSlot);
  return LoadProgram(name);
}

bool LoadProgram(const char* name) {
  return m61_text::load_program(name);
}

bool LoadProgram(u16 id) {
  return m61_text::load_program(id);
}

bool Load(void) {
  isize address;
  {
    MK61DisplayUpdate update(main_lcd());
    main_lcd().clear();
    library_mk61::print_localized_at(0, 0, M8("ЧТ "), "Load ", 5);
    address = calc_address();
  }
  if(address < 0) return false; // Ошибка

  const usize slot = (usize) (address / FLASH_SECTOR_SIZE);
  return Load(slot);
}

inline bool check_empty_program(void) {
  usize all_to_or = 0;
  const usize program_steps = core_61::program_steps();
  for(usize i=0; i < program_steps; i++) all_to_or |= (usize) core_61::get_code(/*mk61s.*/core_61::get_ring_address(i));
  if(all_to_or == 0) {
    library_mk61::print_localized_at(0, 0, M8("Нет программ"),
                                     "No program...");
    sound(PIN_BUZZER, 4000, 750, library_mk61::sound_volume());
    delay_with_sound_poll(1500);
    return true;
  }
  return false;
}

bool StoreProgram(const char* name) {
  return StoreProgram(program_store::ROOT_ID, name);
}

bool StoreProgram(u16 parent_id, const char* name) {
  if(check_empty_program()) return false; // Ошибка
  if(name == NULL || name[0] == 0) return false;

  shared_scratch::Lease scratch(shared_scratch::Owner::M61_FORMAT, program_store::MAX_MK61_TEXT_SIZE);
  if(!scratch.ok()) return false;
  u8* script_buffer = scratch.data();
  u16 script_len = 0;
  if(!m61_text::format_current_program(script_buffer, scratch.size(), &script_len)) return false;
  if(!program_store::write_file(parent_id, program_store::INVALID_ID,
                                program_store::ProgramType::MK61, name,
                                script_buffer, script_len, NULL)) return false;

  dbg(MINI, "\nProgramm saved!");
  return true;
}

bool Store(usize nSlot) {
  char name[8];
  snprintf(name, sizeof(name), "%u", (unsigned) nSlot);
  return StoreProgram(name);
}

bool Store(void) {
  {
    MK61DisplayUpdate update(main_lcd());
    main_lcd().clear(); main_lcd().setCursor(0, 0);
  }

  if(check_empty_program()) return false; // Ошибка

  isize address;
  {
    MK61DisplayUpdate update(main_lcd());
    library_mk61::print_localized_at(0, 0, M8("ПИС "),
                                     "Save ", 5); //main_lcd().setCursor(7, 0);
    address = calc_address();
  }
  if(address < 0) return false; // Ошибка

  char name[8];
  snprintf(name, sizeof(name), "%u", (unsigned) (address / FLASH_SECTOR_SIZE));
  if(program_store::exists(program_store::ProgramType::MK61, name)) {
    #ifdef DEBUG_SPIFLASH
      Serial.print("SPIFLASH: SLOT IS OCCUPIED ");
      Serial.println(address);
    #endif
    sound(PIN_BUZZER, 4000, 750, library_mk61::sound_volume());
    {
      MK61DisplayUpdate update(main_lcd());
      main_lcd().setCursor(0, 0); main_lcd().print(library_mk61::text("OVER", "OVER")); main_lcd().setCursor(8, 0); main_lcd().print(library_mk61::text("press OK", "OK?"));
    }
    if(kbd::get_key_wait() != KEY_OK) return false; // Ошибка
  }

  #ifdef DEBUG_SPIFLASH
    Serial.print("SPIFLASH: write to address ");
    Serial.println(address);
  #endif

  #ifdef DEBUG_SPIFLASH
    Serial.print("SPIFLASH: erase sector...");
  #endif
  u8 code_page[core_61::CODE_PAGE_BUFFER_SIZE] = {};
  core_61::get_code_page(&code_page[0]);
  const usize code_len = seek_program_END(&code_page[0]);

  shared_scratch::Lease scratch(shared_scratch::Owner::M61_FORMAT, program_store::MAX_MK61_TEXT_SIZE);
  if(!scratch.ok()) return false;
  u8* script_buffer = scratch.data();
  u16 script_len = 0;
  if(!m61_text::format_current_program(script_buffer, scratch.size(), &script_len)) return false;

  #ifdef SERIAL_OUTPUT
    Serial.print("Save ");
  #endif

  for(usize i = 0; i < code_len; i++){
    #ifdef SERIAL_OUTPUT
      Serial.write('#');
    #endif
    const u8 x = i / BLOCK_SIZE;
    {
      MK61DisplayUpdate update(main_lcd());
      main_lcd().setCursor(x, 1); main_lcd().print((char) 0xFF); main_lcd().print(i);
    }
  }
  if(!program_store::write_mk61(name, script_buffer, script_len)) return false;

  #ifdef SERIAL_OUTPUT
    Serial.println("\nProgramm saved!");
  #endif
  return true;
}              

